OpenDTEF-v2012/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/0.orig/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.01 0.01 0.01 0.01 0.01 0.01);

boundaryField
{
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    outerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
